// import { 청약중인공모주 } from "@/types";

// export const 현재진행중인공모주: 청약중인공모주[] = [
//   {
//     종목이름: "현대중공업",
//     업종: "선박 및 보트 건조업",
//     주간사: [
//       {
//         증권사이름: "미래에셋",
//         배정주식수: 1475054,
//       },
//       {
//         증권사이름: "한국투자증권",
//         배정주식수: 1421053,
//       },
//       {
//         증권사이름: "하나금융투자",
//         배정주식수: 592105,
//       },
//       {
//         증권사이름: "KB증권",
//         배정주식수: 592105,
//       },
//       {
//         증권사이름: "삼성증권",
//         배정주식수: 207236,
//       },
//       {
//         증권사이름: "대신증권",
//         배정주식수: 88816,
//       },
//       {
//         증권사이름: "DB금융투자",
//         배정주식수: 88816,
//       },
//       {
//         증권사이름: "신영증권",
//         배정주식수: 88816,
//       },
//     ],
//     주간사경쟁률: [
//       {
//         증권사이름: "미래에셋",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "한국투자증권",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "하나금융투자",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "KB증권",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "삼성증권",
//         일반비례경쟁률: 409.01,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "대신증권",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "DB금융투자",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//       {
//         증권사이름: "신영증권",
//         일반비례경쟁률: 404.29,
//         총청약건수: 150,
//       },
//     ],
//     확정공모가: 60000,
//     예상공모가: {
//       최고: 52000,
//       최저: 60000,
//     },
//     기관경쟁률: 1835.87,
//     증거금비율: 50,
//     총의무보유확약비율: 53.09,
//     의무보유확약비율: [
//       {
//         구분: "15일 확약",
//         수량: 195300000,
//       },
//       {
//         구분: "1개월 확약",
//         수량: 2979940000,
//       },
//       {
//         구분: "3개월 확약",
//         수량: 4869591000,
//       },
//       {
//         구분: "6개월 확약",
//         수량: 1606101000,
//       },
//     ],
//     수요예측: [
//       {
//         구분: "미제시",
//         수량: 3066078682,
//       },
//       {
//         구분: "60,000원 이상",
//         수량: 15108954000,
//       },
//       {
//         구분: "52,000원 이상 ~ 60,000원 미만",
//         수량: 45000,
//       },
//       {
//         구분: "52,000원 미만",
//         수량: 0,
//       },
//     ],
//     일정: {
//       수요예측일: {
//         시작일: new Date("2021.09.02"),
//         종료일: new Date("2021.09.03"),
//       },
//       공모청약일: {
//         시작일: new Date("2021.09.07"),
//         종료일: new Date("2021.09.08"),
//       },
//       배정공고일: new Date("2021.09.10"),
//       납입일: new Date("2021.09.10"),
//       환불일: new Date("2021.09.10"),
//       상장일: new Date("2021.09.10"),
//     },
//   },
// ];
